{
    "uuid": [
        {
            "value": "a3cf09c9-8932-4009-964d-28af31dd3078"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "blog",
            "target_type": "node_type",
            "target_uuid": "5e1cc3ac-5c8f-4194-a7db-a96757398273"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2024-12-16T23:06:46+00:00"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "711eae9d-1ca7-45a3-a4b1-9f1e585e1f33"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "94f18ca1-24cf-4db9-8dc7-6771e8d09443"
        }
    ],
    "title": [
        {
            "value": "Agile Development Scrum Terms and Recommendations"
        }
    ],
    "created": [
        {
            "value": "2021-04-22T07:00:00+00:00"
        }
    ],
    "changed": [
        {
            "value": "2024-12-18T18:32:43+00:00"
        }
    ],
    "promote": [
        {
            "value": true
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [
        {
            "value": true
        }
    ],
    "path": [
        {
            "alias": "\/2021\/04\/22\/agile-development-scrum-terms-and-recommendations",
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<p>When starting a new agile project or product with a new team, I often find the need to establish common language. On simple projects, I usually walk the team through the following terms.<\/p><p>The toolset associated with these terms is usually some combination of Jira with Github\/Gitlab\/Bitbucket and a CI\/CD toolchain that connects to hosting. There are many possible toolsets, but the agile product management process that uses scrum methodology nearly always has the same dictionary of terms.<\/p><p>To facilitate some larger projects, and to try and get down definitions that meet my own needs for large Drupal CMS implementations, I am writing this handy guide to the most used terms that I use in consulting.<\/p><p>Rather than present an alphabetical list, I find it best to start with some of the largest concepts and work them down and then back up again in complexity.<\/p><p>So… where to start?<\/p><h2 id=\"product-roadmap\">Product Roadmap<\/h2><p>You are not working solely on a “project” anymore—even if you may call it a project because it has a planned end date and some milestones to get to that state of readiness—note that I didn’t use completeness; most products are never “complete” so long as they are still delivering value.<\/p><p>Once you take on agile methodology to manage your applications, software, or process, you aren’t really working on a strict schedule defined by predecessors and successor tasks as is common in waterfall style project management. That doesn’t mean you can’t project a schedule, but no single task is going to get a start and end date and show up on a gantt chart.<\/p><p>Instead, you are going to break your work into logical pieces related to your product goals, we sometimes call this a roadmap. You are drawing this map as you go. It will change.<\/p><h2 id=\"themes-and-epics\">Themes and Epics<\/h2><p>Your first level of defining your product roadmap is quite broad. If the product is large enough, you may find that you need to group work that represents deliverable features (<strong>epics<\/strong>) into larger categories of work based on your goals (<strong>themes<\/strong>). Not every product roadmap requires themes, but every product roadmap will have epics to help with planning.<\/p><p>If you use themes, you’ll want to keep them broadly-related to the goals of your project. Good examples of themes in large Drupal CMS implementations would include accessibility, mobility, maintenance and devops, and localization (or internationalization if global). While you might use these one-word labels to describe your themes, you should spend some time detailing what success looks like for each.<\/p><p>Epics are the larger features that are related to a theme. Epics themselves are not a deliverable, but they help group the work to achieve a large change to the site. Epics might get target schedules applied to them so that you can show these schedules on a roadmap that looks a little like a gantt chart but is usually more flexible.<\/p><h2 id=\"stories-tasks-and-bugs\">Stories, Tasks, and Bugs<\/h2><p>While epics help you group your work to plan, the deliverable work for your team will come in the form of stories, tasks, and bugs. (Some folks call bugs “defects”, but it seems so much more satisfying to squash a virtual bug—and much less karmically intense than squashing a live bug.)<\/p><h3 id=\"stories\">Stories<\/h3><p>A <strong>story<\/strong> is a discrete set of work that delivers value to your product. Some teams will only use a story to define work that will be delivered as a code change. I am not that picky. To me, a story is anything of value. In addition to code, value could be delivered in the form of documentation, research, analysis, design, or content creation. You will need to set the norms with your team.<\/p><p>Each story should fit into the following criteria that are sometimes abbreviated with the mnemonic I.N.V.E.S.T:Independent: self-contained in a way that allows the work to be released without depending on another story. (Though you can choose to build upon previous stories that were delivered before you release a larger feature.)<\/p><ul>  <li><strong>Negotiable<\/strong>: leave room for conversation as the team is working on the story. Don’t write a contract so much as ensure that you have enough guidance to make the work achievable.<\/li>  <li><strong>Valuable<\/strong>: it’s easy to allow your backlog to grow with stories that don’t represent a lot of value to the end user. Make sure you clean up your backlog and only put work into your work plan (more on that soon) that truly improves the product.<\/li>  <li><strong>Estimable<\/strong>: you need to be able to put a solid guess for how much effort and time a story will take when you start work on it. There are a couple of exceptions to this I will describe below.<\/li>  <li><strong>Small<\/strong>: I would actually argue that this is more of an “as small as feasible” requirement. You might find that very small stories make your deployment pipeline slow to a crawl, but large stories can have a similar impact.<\/li>  <li><strong>Testable<\/strong>: some folks swear by test driven development (TDD). I find that is a bit of overkill for most Drupal CMS projects, but you should know what you intend to test via automated tests and what you need to verify through a quality assurance test from someone on your team. Write this up as acceptance criteria on every story in your sprint. You can modify this test through negotiation—see above—but you need to know that the final thing you deliver is adding the value you hoped to add.<\/li><\/ul><p>(I’m not a huge fan of mnemonics, but sometimes they are helpful.)<\/p><p>I have a couple of exceptions to this recommendation to make it possible to include work in your roadmap that is hard to estimate.<\/p><h3 id=\"pointing-stories\">Pointing Stories<\/h3><p>What is the value of your story? I’ve had teams in the past that joke “points mean prizes”. While I have never actually awarded prizes for “most points completed”,  I really appreciate team members that figure out the ability to estimate how many stories they can take in a given work plan. (I’ll describe sprints below; sprints are iterations of work.)<\/p><p><strong>Points<\/strong> are not strictly a time estimate. Ideally, points represent the difficulty of a story and the general size. There are many different pointing approaches that each have their pros and cons.<\/p><h4 id=\"t-shirt-sizing\">T-Shirt Sizing<\/h4><p>Small, medium, large, and extra large can form the basic of defining story complexity. These labels are handy to abbreviate following the standards used by the clothing industry.<\/p><h4 id=\"1-to-5-or-1-to-4\">1 to 5 (or 1 to 4)<\/h4><p>Is it a 1, 2, 3, 4, or 5? This is probably my least favorite. You have to have an extremely high functioning team to agree what each of these numbers really mean. (It would almost be better to not point at all.)<\/p><h4 id=\"fibonacci-sequence\">Fibonacci Sequence<\/h4><p>The best-named pointing scheme by far! The Fibonacci sequence creates a list of numbers based on adding the previous number to the next number: 1, 2, 3, 5, 8, 13, 21. (1+2=3, 2+3=5, 3+5=8, etc.) This is mathematically beautiful pointing! (The nautilus shell grows based on the Fibonacci ratio—so this pointing scheme happens in nature.)<\/p><h4 id=\"doubling-closest-to-time-based-pointing\">Doubling (Closest to Time-based Pointing)<\/h4><p>My personal favorite for teams new to pointing stories is a doubling scheme: 1, 2, 4, 8, 16, 32.<\/p><p>Doubling is the closest to time-based pointing. Some would say this is a reason not to use this approach, but everybody can get the idea that a point is roughly an hour. By enforcing doubling, you basically tell your team that hour estimates are not that accurate. You are more accurate with smaller stories and less accurate the more complex they get. 16 doesn’t mean 16 hours, it means the story is probably a couple days of work—give or take. 8 is not a commitment to finishing a story in a day, but it does mean you think the story will take you “about a day”.<\/p><p>My teams limit the use of 32 point stories to <em>spikes<\/em>. What’s a spike? A spike is a story that is really hard to estimate because it involves investigation and analysis. (The lore behind the name spike suggests it was related to mountain climbing and the act of setting a spike to help define your path and anchor you to the parts of the route you already know. That lore might be true—I hope it is.)<\/p><p>You can point spikes that are smaller than 32 points—with the expectation that they are “time-boxed” to less time.<\/p><p>Some teams choose not to point spikes, but personally, I feel that makes it hard to balance your team members’ load of work in a sprint.<\/p><p>Pointed stories are the core of planning your product roadmap, but there are other types of work that will get added to your backlog and into your sprints.<\/p><h3 id=\"tasks\">Tasks<\/h3><p>Tasks are quick work that can be completed without a lot of complexity—and usually not much direct value to the product. Each team may choose to use tasks differently. Most teams choose to not point tasks.<\/p><h3 id=\"bugs\">Bugs<\/h3><p>Dangit! There’s a bug!<\/p><p>Seriously, bugs happen. When you find a defect in your product that needs to be fixed. Add it to your backlog and prioritize it. Most teams don’t point bugs—similar to spikes, they are extremely difficult to estimate.<\/p><h2 id=\"sprints\">Sprints<\/h2><p>So now, you have your themes &gt; epics &gt; stories\/tasks\/bugs (and your stories are pointed) and you are ready to plan a <strong>sprint<\/strong>.<\/p><p>I understand why they are called “sprints”—they are a short period of time; they represent a short term goal—though I wish the term was “iteration” or “period”. Constantly “sprinting” is kinda exhausting. Building a great software product is really more of a long-distance sort of run.<\/p><p>That said, sprints are the frequency of your planning and agile rituals. You don’t want to plan for sprints that are too long (a month-long sprint is really the maximum) or too short (less than a week would be kinda insane). I’m a fan of 2 or 3 week sprints, but it really does depend on the team.<\/p><p>Sprints have three types of regular meetings (rituals) that define their cadence: sprint planning, standups, grooming meetings, and sprint retrospectives.<\/p><h3 id=\"sprint-planning\">Sprint Planning<\/h3><p>At the start of each sprint, you want to bring the team together to determine the following:<\/p><ul>  <li>What is the start and end date of the sprint?<\/li>  <li>Who is available for the sprint—and how much? (Plan for time off!)<\/li>  <li>What are the goals of the sprint?What stories, tasks, and bugs should be included from the backlog?<\/li>  <li>Who gets what stories as their assignments?At the end of sprint planning, you should have what amounts to a team contract regarding what you’d like to complete in that period of time.<\/li><\/ul><h3 id=\"standups\">Standups<\/h3><p>The name <strong>standup<\/strong> comes from the idea that you shouldn’t sit down for this quick meeting that should ideally last less than 15 minutes. You want to hold a standup everyday that you aren’t planning or holding a retrospective—we don’t want to meet so much that we don’t have time to get things done.<\/p><p>In a standup, you are just keeping each other up to date on your progress towards the sprint plan. There are three questions you may answer in your brief daily update:<\/p><ul>  <li>What I did yesterday…<\/li>  <li>What do I plan to do today…<\/li>  <li>What is blocking my work…<\/li><\/ul><p>I have yet to work with a team that is truly great at the timing of standups. My best attempt at getting a team to stick to the timing involved a 2 minute timer on my phone that would quack if the team member went over time. At least we got to laugh at the time-keeping device.<\/p><p>The most important part of standups is learning the blockers and figuring out a way around those blockers.<\/p><h3 id=\"grooming\">Grooming<\/h3><p>Another weird scrum word, <strong>grooming<\/strong> is the act of making sure your backlog is ready for the next planning session. Every sprint should have some time to work through negotiating the details of your stories to make sure you can point them and put them into an upcoming sprint.<\/p><p>I recommend about an hour per week of sprint dedicated to grooming. If your team velocity allows, you could easily spend up to 3 hours grooming stories for future sprints.<\/p><h3 id=\"sprint-retrospectives\">Sprint Retrospectives<\/h3><p>At the end of each sprint, the team should conduct a <strong>retrospective<\/strong> (AKA “retros”) and to talk through the following:<\/p><ul>  <li>What went well this sprint? (Celebrations)<\/li>  <li>What could have gone better? (Blockers to the plan)<\/li>  <li>What are we going to change going forward?<\/li><\/ul><p>High-functioning teams using scrum for product development will use this time for honest and reflective feedback.<\/p><h3 id=\"demonstrations-with-stakeholders\">Demonstrations with Stakeholders<\/h3><p>Often tacked on to the end of the retrospective meetings, demos are the key to making sure you are doing the correct work and give your stakeholders a chance to add feedback. Stakeholder feedback should be captured as future epics, stories, tasks, and bugs.<\/p><p>Demonstrations can be a mix of show and tell and usability testing with stakeholders actually trying out the feature while the team watches and takes notes.<\/p><h2 id=\"optional-but-helpful-rituals\">Optional (But Helpful) Rituals<\/h2><h3 id=\"planning-retreat\">Planning Retreat<\/h3><p>You may find that you need to spend an extended time planning the roadmap with the team on a quarterly basis to build up a longer term roadmap and weed out stories that may never be addressed. Think of these sessions as extended and more intense grooming. You might even meet for 3-4 hours several times over the course of a week to talk through product vision and goals or two break down collected analytics and study of usability test artifacts.<\/p><p>Don’t plan a sprint over the top of these retreats. Use the time as a way to reset and get back to a shared vision. This is especially helpful for larger products that have multiple scrum teams that collaborate on separate components. Getting these teams together to hear presentations from all the teams involved is invaluable in creating a cohesive product.<\/p><h3 id=\"pair-programming\">Pair Programming<\/h3><p>During any given sprint, you may choose to assign a story to more than a single developer to ensure knowledge sharing\/skills or to just tackle a particularly difficult problem. Giving team members the freedom to work together rather than in isolation is a great way to foster creativity and a better final product.<\/p><h2 id=\"when-is-the-scrum-project-complete\">When is the Scrum Project Complete?<\/h2><p>Software applications and website platforms tend to go through a software lifecycle that starts with investing in the product then transitioning to more of a sustain and maintain and eventually to deprecate and\/or replace.<\/p><p>Scrum is appropriate for organizations investing in their application.<\/p>",
            "format": "content_format",
            "processed": "<p>When starting a new agile project or product with a new team, I often find the need to establish common language. On simple projects, I usually walk the team through the following terms.<\/p>\n<p>The toolset associated with these terms is usually some combination of Jira with Github\/Gitlab\/Bitbucket and a CI\/CD toolchain that connects to hosting. There are many possible toolsets, but the agile product management process that uses scrum methodology nearly always has the same dictionary of terms.<\/p>\n<p>To facilitate some larger projects, and to try and get down definitions that meet my own needs for large Drupal CMS implementations, I am writing this handy guide to the most used terms that I use in consulting.<\/p>\n<p>Rather than present an alphabetical list, I find it best to start with some of the largest concepts and work them down and then back up again in complexity.<\/p>\n<p>So… where to start?<\/p>\n<h2>Product Roadmap<\/h2>\n<p>You are not working solely on a “project” anymore—even if you may call it a project because it has a planned end date and some milestones to get to that state of readiness—note that I didn’t use completeness; most products are never “complete” so long as they are still delivering value.<\/p>\n<p>Once you take on agile methodology to manage your applications, software, or process, you aren’t really working on a strict schedule defined by predecessors and successor tasks as is common in waterfall style project management. That doesn’t mean you can’t project a schedule, but no single task is going to get a start and end date and show up on a gantt chart.<\/p>\n<p>Instead, you are going to break your work into logical pieces related to your product goals, we sometimes call this a roadmap. You are drawing this map as you go. It will change.<\/p>\n<h2>Themes and Epics<\/h2>\n<p>Your first level of defining your product roadmap is quite broad. If the product is large enough, you may find that you need to group work that represents deliverable features (<strong>epics<\/strong>) into larger categories of work based on your goals (<strong>themes<\/strong>). Not every product roadmap requires themes, but every product roadmap will have epics to help with planning.<\/p>\n<p>If you use themes, you’ll want to keep them broadly-related to the goals of your project. Good examples of themes in large Drupal CMS implementations would include accessibility, mobility, maintenance and devops, and localization (or internationalization if global). While you might use these one-word labels to describe your themes, you should spend some time detailing what success looks like for each.<\/p>\n<p>Epics are the larger features that are related to a theme. Epics themselves are not a deliverable, but they help group the work to achieve a large change to the site. Epics might get target schedules applied to them so that you can show these schedules on a roadmap that looks a little like a gantt chart but is usually more flexible.<\/p>\n<h2>Stories, Tasks, and Bugs<\/h2>\n<p>While epics help you group your work to plan, the deliverable work for your team will come in the form of stories, tasks, and bugs. (Some folks call bugs “defects”, but it seems so much more satisfying to squash a virtual bug—and much less karmically intense than squashing a live bug.)<\/p>\n<h3>Stories<\/h3>\n<p>A <strong>story<\/strong> is a discrete set of work that delivers value to your product. Some teams will only use a story to define work that will be delivered as a code change. I am not that picky. To me, a story is anything of value. In addition to code, value could be delivered in the form of documentation, research, analysis, design, or content creation. You will need to set the norms with your team.<\/p>\n<p>Each story should fit into the following criteria that are sometimes abbreviated with the mnemonic I.N.V.E.S.T:Independent: self-contained in a way that allows the work to be released without depending on another story. (Though you can choose to build upon previous stories that were delivered before you release a larger feature.)<\/p>\n<ul>\n<li><strong>Negotiable<\/strong>: leave room for conversation as the team is working on the story. Don’t write a contract so much as ensure that you have enough guidance to make the work achievable.<\/li>\n<li><strong>Valuable<\/strong>: it’s easy to allow your backlog to grow with stories that don’t represent a lot of value to the end user. Make sure you clean up your backlog and only put work into your work plan (more on that soon) that truly improves the product.<\/li>\n<li><strong>Estimable<\/strong>: you need to be able to put a solid guess for how much effort and time a story will take when you start work on it. There are a couple of exceptions to this I will describe below.<\/li>\n<li><strong>Small<\/strong>: I would actually argue that this is more of an “as small as feasible” requirement. You might find that very small stories make your deployment pipeline slow to a crawl, but large stories can have a similar impact.<\/li>\n<li><strong>Testable<\/strong>: some folks swear by test driven development (TDD). I find that is a bit of overkill for most Drupal CMS projects, but you should know what you intend to test via automated tests and what you need to verify through a quality assurance test from someone on your team. Write this up as acceptance criteria on every story in your sprint. You can modify this test through negotiation—see above—but you need to know that the final thing you deliver is adding the value you hoped to add.<\/li>\n<\/ul>\n<p>(I’m not a huge fan of mnemonics, but sometimes they are helpful.)<\/p>\n<p>I have a couple of exceptions to this recommendation to make it possible to include work in your roadmap that is hard to estimate.<\/p>\n<h3>Pointing Stories<\/h3>\n<p>What is the value of your story? I’ve had teams in the past that joke “points mean prizes”. While I have never actually awarded prizes for “most points completed”,  I really appreciate team members that figure out the ability to estimate how many stories they can take in a given work plan. (I’ll describe sprints below; sprints are iterations of work.)<\/p>\n<p><strong>Points<\/strong> are not strictly a time estimate. Ideally, points represent the difficulty of a story and the general size. There are many different pointing approaches that each have their pros and cons.<\/p>\n<h4>T-Shirt Sizing<\/h4>\n<p>Small, medium, large, and extra large can form the basic of defining story complexity. These labels are handy to abbreviate following the standards used by the clothing industry.<\/p>\n<h4>1 to 5 (or 1 to 4)<\/h4>\n<p>Is it a 1, 2, 3, 4, or 5? This is probably my least favorite. You have to have an extremely high functioning team to agree what each of these numbers really mean. (It would almost be better to not point at all.)<\/p>\n<h4>Fibonacci Sequence<\/h4>\n<p>The best-named pointing scheme by far! The Fibonacci sequence creates a list of numbers based on adding the previous number to the next number: 1, 2, 3, 5, 8, 13, 21. (1+2=3, 2+3=5, 3+5=8, etc.) This is mathematically beautiful pointing! (The nautilus shell grows based on the Fibonacci ratio—so this pointing scheme happens in nature.)<\/p>\n<h4>Doubling (Closest to Time-based Pointing)<\/h4>\n<p>My personal favorite for teams new to pointing stories is a doubling scheme: 1, 2, 4, 8, 16, 32.<\/p>\n<p>Doubling is the closest to time-based pointing. Some would say this is a reason not to use this approach, but everybody can get the idea that a point is roughly an hour. By enforcing doubling, you basically tell your team that hour estimates are not that accurate. You are more accurate with smaller stories and less accurate the more complex they get. 16 doesn’t mean 16 hours, it means the story is probably a couple days of work—give or take. 8 is not a commitment to finishing a story in a day, but it does mean you think the story will take you “about a day”.<\/p>\n<p>My teams limit the use of 32 point stories to <em>spikes<\/em>. What’s a spike? A spike is a story that is really hard to estimate because it involves investigation and analysis. (The lore behind the name spike suggests it was related to mountain climbing and the act of setting a spike to help define your path and anchor you to the parts of the route you already know. That lore might be true—I hope it is.)<\/p>\n<p>You can point spikes that are smaller than 32 points—with the expectation that they are “time-boxed” to less time.<\/p>\n<p>Some teams choose not to point spikes, but personally, I feel that makes it hard to balance your team members’ load of work in a sprint.<\/p>\n<p>Pointed stories are the core of planning your product roadmap, but there are other types of work that will get added to your backlog and into your sprints.<\/p>\n<h3>Tasks<\/h3>\n<p>Tasks are quick work that can be completed without a lot of complexity—and usually not much direct value to the product. Each team may choose to use tasks differently. Most teams choose to not point tasks.<\/p>\n<h3>Bugs<\/h3>\n<p>Dangit! There’s a bug!<\/p>\n<p>Seriously, bugs happen. When you find a defect in your product that needs to be fixed. Add it to your backlog and prioritize it. Most teams don’t point bugs—similar to spikes, they are extremely difficult to estimate.<\/p>\n<h2>Sprints<\/h2>\n<p>So now, you have your themes &gt; epics &gt; stories\/tasks\/bugs (and your stories are pointed) and you are ready to plan a <strong>sprint<\/strong>.<\/p>\n<p>I understand why they are called “sprints”—they are a short period of time; they represent a short term goal—though I wish the term was “iteration” or “period”. Constantly “sprinting” is kinda exhausting. Building a great software product is really more of a long-distance sort of run.<\/p>\n<p>That said, sprints are the frequency of your planning and agile rituals. You don’t want to plan for sprints that are too long (a month-long sprint is really the maximum) or too short (less than a week would be kinda insane). I’m a fan of 2 or 3 week sprints, but it really does depend on the team.<\/p>\n<p>Sprints have three types of regular meetings (rituals) that define their cadence: sprint planning, standups, grooming meetings, and sprint retrospectives.<\/p>\n<h3>Sprint Planning<\/h3>\n<p>At the start of each sprint, you want to bring the team together to determine the following:<\/p>\n<ul>\n<li>What is the start and end date of the sprint?<\/li>\n<li>Who is available for the sprint—and how much? (Plan for time off!)<\/li>\n<li>What are the goals of the sprint?What stories, tasks, and bugs should be included from the backlog?<\/li>\n<li>Who gets what stories as their assignments?At the end of sprint planning, you should have what amounts to a team contract regarding what you’d like to complete in that period of time.<\/li>\n<\/ul>\n<h3>Standups<\/h3>\n<p>The name <strong>standup<\/strong> comes from the idea that you shouldn’t sit down for this quick meeting that should ideally last less than 15 minutes. You want to hold a standup everyday that you aren’t planning or holding a retrospective—we don’t want to meet so much that we don’t have time to get things done.<\/p>\n<p>In a standup, you are just keeping each other up to date on your progress towards the sprint plan. There are three questions you may answer in your brief daily update:<\/p>\n<ul>\n<li>What I did yesterday…<\/li>\n<li>What do I plan to do today…<\/li>\n<li>What is blocking my work…<\/li>\n<\/ul>\n<p>I have yet to work with a team that is truly great at the timing of standups. My best attempt at getting a team to stick to the timing involved a 2 minute timer on my phone that would quack if the team member went over time. At least we got to laugh at the time-keeping device.<\/p>\n<p>The most important part of standups is learning the blockers and figuring out a way around those blockers.<\/p>\n<h3>Grooming<\/h3>\n<p>Another weird scrum word, <strong>grooming<\/strong> is the act of making sure your backlog is ready for the next planning session. Every sprint should have some time to work through negotiating the details of your stories to make sure you can point them and put them into an upcoming sprint.<\/p>\n<p>I recommend about an hour per week of sprint dedicated to grooming. If your team velocity allows, you could easily spend up to 3 hours grooming stories for future sprints.<\/p>\n<h3>Sprint Retrospectives<\/h3>\n<p>At the end of each sprint, the team should conduct a <strong>retrospective<\/strong> (AKA “retros”) and to talk through the following:<\/p>\n<ul>\n<li>What went well this sprint? (Celebrations)<\/li>\n<li>What could have gone better? (Blockers to the plan)<\/li>\n<li>What are we going to change going forward?<\/li>\n<\/ul>\n<p>High-functioning teams using scrum for product development will use this time for honest and reflective feedback.<\/p>\n<h3>Demonstrations with Stakeholders<\/h3>\n<p>Often tacked on to the end of the retrospective meetings, demos are the key to making sure you are doing the correct work and give your stakeholders a chance to add feedback. Stakeholder feedback should be captured as future epics, stories, tasks, and bugs.<\/p>\n<p>Demonstrations can be a mix of show and tell and usability testing with stakeholders actually trying out the feature while the team watches and takes notes.<\/p>\n<h2>Optional (But Helpful) Rituals<\/h2>\n<h3>Planning Retreat<\/h3>\n<p>You may find that you need to spend an extended time planning the roadmap with the team on a quarterly basis to build up a longer term roadmap and weed out stories that may never be addressed. Think of these sessions as extended and more intense grooming. You might even meet for 3-4 hours several times over the course of a week to talk through product vision and goals or two break down collected analytics and study of usability test artifacts.<\/p>\n<p>Don’t plan a sprint over the top of these retreats. Use the time as a way to reset and get back to a shared vision. This is especially helpful for larger products that have multiple scrum teams that collaborate on separate components. Getting these teams together to hear presentations from all the teams involved is invaluable in creating a cohesive product.<\/p>\n<h3>Pair Programming<\/h3>\n<p>During any given sprint, you may choose to assign a story to more than a single developer to ensure knowledge sharing\/skills or to just tackle a particularly difficult problem. Giving team members the freedom to work together rather than in isolation is a great way to foster creativity and a better final product.<\/p>\n<h2>When is the Scrum Project Complete?<\/h2>\n<p>Software applications and website platforms tend to go through a software lifecycle that starts with investing in the product then transitioning to more of a sustain and maintain and eventually to deprecate and\/or replace.<\/p>\n<p>Scrum is appropriate for organizations investing in their application.<\/p>\n",
            "summary": null
        }
    ],
    "feeds_item": [
        {
            "imported": "2024-12-16T23:06:46+00:00",
            "guid": null,
            "hash": "f14104d0a2e85cdadd0d0527427221dd",
            "target_type": "feeds_feed",
            "target_uuid": "ede5cec9-4a3f-4def-a896-6a22b335f811"
        }
    ],
    "field_description": [
        {
            "value": "When starting work consulting with a new team, we often find the need to establish common language. On simple projects, I usually walk the team through the terms as part of walking through the toolset."
        }
    ],
    "field_featured_image": [],
    "field_seo_description": [],
    "field_seo_image": [],
    "field_seo_title": [],
    "field_tags": []
}