{
    "uuid": [
        {
            "value": "89352d69-2e6d-41a9-bbe4-845d347fbc65"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "blog",
            "target_type": "node_type",
            "target_uuid": "5e1cc3ac-5c8f-4194-a7db-a96757398273"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2025-04-21T19:53:00+00:00"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "94f18ca1-24cf-4db9-8dc7-6771e8d09443"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "94f18ca1-24cf-4db9-8dc7-6771e8d09443"
        }
    ],
    "title": [
        {
            "value": "What the US Department of Justice Accessibility Ruling Means for Your Organization"
        }
    ],
    "created": [
        {
            "value": "2025-04-18T16:10:00+00:00"
        }
    ],
    "changed": [
        {
            "value": "2025-04-21T19:53:00+00:00"
        }
    ],
    "promote": [
        {
            "value": true
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [
        {
            "value": true
        }
    ],
    "path": [
        {
            "alias": "\/blog\/2025\/doj-accessibility-ruling",
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<drupal-media data-entity-type=\"media\" data-entity-uuid=\"78646f06-bdb4-48dd-8786-daa0d230dd1e\" data-view-mode=\"large\">&nbsp;<\/drupal-media><p>I was a guest on <a href=\"https:\/\/talkingdrupal.com\/498\">Talking Drupal episode #498<\/a> (released Monday, April 21st) to talk about the Department of justice accessibility ruling. While that podcast is focused on Drupal as a content management framework, the topic is not platform specific.<\/p><h2 dir=\"ltr\">What is the U.S. Department of Justice Accessibility Ruling?<\/h2><p dir=\"ltr\">The Web Content Accessibility Guidelines (WCAG) Version 2.1, Level AA is now the technical standard for state and local governments’ web content and mobile apps within the United States.<\/p><p dir=\"ltr\"><a href=\"https:\/\/www.justice.gov\/archives\/opa\/pr\/justice-department-publish-final-rule-strengthen-web-and-mobile-app-access-people\">The rule became effective June 24, 2024<\/a>.<\/p><p dir=\"ltr\"><a href=\"https:\/\/www.ada.gov\/assets\/pdfs\/web-rule.pdf\">Read the full text of the rule (PDF)<\/a>.<\/p><p dir=\"ltr\">Read the fact sheet provided by ADA.gov<\/p><p dir=\"ltr\">Here is a condensed summary of the exceptions:<\/p><ul><li dir=\"ltr\">“Archived” web content that was created before the date of required compliance that is clearly for reference, research, and\/or record keeping in a separate section of the site that has not been updated.<\/li><li dir=\"ltr\">Preexisting conventional electronic documents (Word, PDF, Powerpoint, Spreadsheets, etc.) created before the date of required compliance. (Hard to audit externally, so expect records requests.)<\/li><li dir=\"ltr\">Content posted by a third party where the posting is not due to contractual, licensing, or other arrangements with the public entity. This&nbsp;<strong>does not include<\/strong> applications provided by a third party via a contract with the government including scheduling, calendaring, reservations systems, maps (Google Maps, ArcGIS, etc.), payment systems.<\/li><li dir=\"ltr\">Individualized documents that are password-protected such as a water bill PDF or a file that the person can download associated with their account. (I’m really not sure why this is an exception. The wording seems to allow some pretty critical service-delivery documents, such as a personalized water bill, to be exempt.)<\/li><li dir=\"ltr\">Preexisting social media posts.<\/li><li dir=\"ltr\">Only technical or legal limitations apply to the use of conforming alternate versions. (I don’t think this one will stand up to scrutiny.)<\/li><\/ul><p dir=\"ltr\">It will be up to the state or local government to show that a “minor” infringement of WCAG 2.1 AA is still accessible. In practice, that is going to mean a lot of back and forth in the first few rulings against a state or local government that is out of compliance. The cost of the burden of proof will disproportionately fall on the government entity.<\/p><h2 dir=\"ltr\">Who is impacted? What makes it a government website or mobile application?<\/h2><p dir=\"ltr\">First, there is a little bit of a misunderstanding of part of this ruling. It is not aimed at federal websites. Federal websites have been&nbsp;<em>required<\/em> to be accessible since 1998 with rules and policies over time that have slowly clarified the requirement for WCAG compliance. These standards are known as <a href=\"https:\/\/www.section508.gov\/manage\/laws-and-policies\/\">Section 508<\/a>.<\/p><p dir=\"ltr\">This new rule is specifically aimed at state, local, and special districts with a timeline for compliance based on the size of the organization.<\/p><p dir=\"ltr\">Examples of state and local governments include:<\/p><ul><li dir=\"ltr\">State and local government offices that provide benefits and\/or social services, like food assistance, health insurance, or employment services<\/li><li dir=\"ltr\">Public schools, community colleges, and public universities<\/li><li dir=\"ltr\">State and local police departments<\/li><li dir=\"ltr\">State and local courts<\/li><li dir=\"ltr\">State and local elections offices<\/li><li dir=\"ltr\">Public hospitals and public healthcare clinics<\/li><li dir=\"ltr\">Public parks and recreation programs<\/li><li dir=\"ltr\">Public libraries<\/li><li dir=\"ltr\">Public transit agencies<\/li><\/ul><p dir=\"ltr\">So this definition is interesting. A school district would be required to use the population of its containing city to know when to comply. That is likely going to get challenged by schools that sit in two cities, but I would imagine, the rule will be enforced more strictly rather than having exceptions for smaller districts within large cities at the outset.&nbsp;<\/p><p dir=\"ltr\">For example, my wife’s school district, she’s a school principal, is relatively small in population compared with the much larger Portland Public Schools district nearby. Both are in the same city, so they have the same deadline despite wildly different resources to address the ruling.<\/p><h2 dir=\"ltr\">When does the rule require compliance?<\/h2><p dir=\"ltr\">It’s all about the organization size, but there isn’t a lot of granularity:<\/p><ul><li dir=\"ltr\">State and local governments more than 50,000 people need to be compliant by&nbsp;<strong>April 24, 2026<\/strong>.<\/li><li dir=\"ltr\">State and local governments smaller than 50,000 people need to be compliant by&nbsp;<strong>April 26, 2027<\/strong>.<\/li><li dir=\"ltr\">Special district governments need to be compliant by&nbsp;<strong>April 26, 2027<\/strong>.<\/li><\/ul><p dir=\"ltr\">Per the ruling, there is a definition for a special district.<\/p><blockquote><p dir=\"ltr\">Special district government means a public entity—other than a county, municipality, township, or independent school district—authorized by State law to provide one function or a limited number of designated functions with sufficient administrative and fiscal autonomy to qualify as a separate government and whose population is not calculated by the United States Census Bureau in the most recent decennial Census or Small Area Income and Poverty Estimates.<\/p><\/blockquote><p dir=\"ltr\">An example would be something like Metro in Oregon, which is a special district that includes three counties that are in the Portland metropolitan area. I find it a bit odd that a special district serving more than 50,000 people gets a longer deadline. I wonder a bit if this was to allow more time for organizations that may have less funding (in theory) than a state, county, or city. For instance, Metro has a much smaller communications and IT department than most of the counties it serves.<\/p><h2 dir=\"ltr\">How can websites and mobile applications audit their compliance?<\/h2><p dir=\"ltr\"><a href=\"blank\">Per Drupal.org’s excellent guidance on running an accessibility review<\/a>:<\/p><blockquote><p dir=\"ltr\">Many accessibility problems can be caught by running the page through automated tools. Some of the automated tools include<a href=\"https:\/\/wave.webaim.org\">&nbsp;WAVE<\/a>, <a href=\"https:\/\/tenon.io\/get-code\/\">Tenon<\/a>, <a href=\"https:\/\/accessibilityinsights.io\">Accessibility Insights<\/a>, <a href=\"https:\/\/developers.google.com\/web\/tools\/lighthouse\/\">Google Lighthouse<\/a>, <a href=\"https:\/\/siteimprove.com\/\">Siteimprove<\/a> and the<a href=\"https:\/\/chrome.google.com\/webstore\/search\/siteimprove?hl=en-US\">&nbsp;Siteimprove Accessibility Checker<\/a> extension for Chrome. Some of this can be automated by using<a href=\"https:\/\/github.com\/dequelabs\/axe-core\/\">&nbsp;axe-core<\/a>. These tools will help you quickly catch some accessibility issues, such as the incorrect structure of the markup, missing ARIA attributes and insufficient color contrast.<\/p><\/blockquote><p dir=\"ltr\">Drupal Core has some accessibility checks that require manual testing when the user interface changes. There is&nbsp;<a href=\"https:\/\/www.drupal.org\/project\/drupalci\/issues\/2857808\">automated coverage planned using Nightwatch tests<\/a>—&nbsp;though Playwright is being considered as well.<\/p><p dir=\"ltr\">At a minimum, government organizations need to start running at least rudimentary tests against all their web and mobile applications. (I’m really curious why desktop applications were completely omitted. Likely because they are rare, but I could see lawsuits arising.)<\/p><p dir=\"ltr\">All state and local government organizations should start an accessibility audit strategy now. It will put you in a position to know your risks going into next year's initial deadline.<\/p><h2 dir=\"ltr\">How are most governments faring now?<\/h2><p dir=\"ltr\">Sites running Drupal are already a step ahead of most other platforms in the tests I’ve run. Drupal sites are not perfect, but the community’s commitment to accessibility really shows in these sites—particularly ones running on modern Drupal rather than Drupal 7 or earlier.&nbsp;<\/p><p dir=\"ltr\">The biggest risk to government accessibility of web and mobile content is the copious “custom off the shelf” (COTS) applications from third-party vendors that primarily sell to government organizations.&nbsp;<\/p><p dir=\"ltr\">Some of these systems are great—many reduce the costs of providing services that would be expensive to build internally such as permitting systems, legislative records keeping, and tools to report government fraud and request records all have extremely limited accessibility awareness. However, many of these tools were built before accessibility became a priority. Just take GovQA, it has become a go to for records request systems in government. I’ve seen many implementations of GovQA that are woefully out of date and inaccessible. A recent review of a GovQA instance updated in the past two years has errors such as alt=”img” and layout tables. Layout tables are not only an accessibility issue, but they also represent code debt from at least a decade ago. (CSS layouts for forms and content have been the norm since at least 20 years ago.)<\/p><p dir=\"ltr\">GovQA is not alone in these issues. Granicus (which also owns GovQA) has an agenda and meeting management system that has similar levels of accessibility errors and alerts for a typical installation.<\/p><p dir=\"ltr\">I don't mean to pick on Granicus products. They have some great software trying to improve governement services. Their risk is a bit broader than many vendors because they have acquired so many applications from smaller companies over the past 10 to 15 years. The number of vendors and COTS applications in use by state and local governments is significant. Some even have what is known as a Voluntary Product Accessibility Template or VPAT for short. While some governments have just started to require these documents in procurement processes in the last five years or so, there is absolutely zero enforcement of accuracy for VPATs—after all, they are voluntary.<\/p><h2 dir=\"ltr\">Is one, or even two, years enough time to become compliant?<\/h2><p dir=\"ltr\">No. I disagree strongly with the ruling’s assumption that the changes should be cost neutral for most government organizations. COTS applications alone represent years of development needed by third-party vendors that will have no motivation to improve their products when governments have little recourse or alternative products to deploy.<\/p><p dir=\"ltr\">Developing alternative applications for smaller state and local governments is not feasible. Buying alternatives would both require an alternative to exist and that that alternative is similarly priced. Even if similarly priced alternatives exist, the typical government software procurement process—assuming no new hardware requirements—is at least six months and often a year or more.<\/p><p dir=\"ltr\">Unfortunately, state and local governments within the U.S. should have known these requirements were coming for years. Broad accessibility compliance has simply not been a priority in IT departments that are struggling to keep up with overall demand for digital services.&nbsp;<\/p><p dir=\"ltr\">Even if a state or local government makes accessibility remediation for compliance a priority in their web and mobile applications, it will take years of concentrated effort and better procurement gates to ensure new web and mobile applications are accessible from the start.<\/p><p dir=\"ltr\">I expect the ruling's assumptions will get challenged as state and local governments report on the real costs and timelines for compliance.<\/p><h2 dir=\"ltr\">Why should a government ensure they are compliant with the standards and the ruling?<\/h2><p dir=\"ltr\">Well, because it is the right thing to do. Accessible content and services improve the experience for everyone.<\/p><p dir=\"ltr\">And… I truly believe the ruling could be unevenly enforced based on city demographics. There is a clear correlation between voting preferences and urban density. As a result, progressive cities already doing their best to be as equitable as possible could be targeted with lawsuits and hit with significant financial risks for the 2026 deadline. At a time when many of these organizations are already seeing drastic budget cuts, this possibility should not be taken lightly.<\/p><p dir=\"ltr\">Or maybe I’m wrong. The current executive administration has little interest in promoting diversity, equity, and inclusion initiatives. They have even taken steps to remove language about equity from many federal websites. It's also possible that the ruling is not enforced in any significant way by the Department of Justice.<\/p><p dir=\"ltr\">Even if the DOJ does not enforce the ruling actively, there will likely private lawsuits and significant court rulings to consider.<\/p><p dir=\"ltr\">The time is ticking for the April 24, 2026 and April 26, 2027 deadlines. At the very least, state and local governments should be conducting manual or automated audits of every public facing web or mobile application they use to interact with their communities. Only by knowing the scope of the risk can they begin to address it.<\/p><h2>Next steps<\/h2><h3>Step 1: Plan an audit<\/h3><p>This post points to a few resources that can help you plan an audit. Your audit may include manual and\/or automated tests. The scope of the audit should include all public facing web content (including web applications provided by third-party vendors hosting content on behalf of the government) as well as any mobile applications that can be used by the public.<\/p><p>If your organization does not have a well-defined list of all applications it supports, this is probably the starting point.<\/p><h3>Step 2: Prioritize services<\/h3><p>The biggest impact will be online services that may also serve to reduce costs associated with delivering those services. Think about your tools that are used most often: \"pay my water bill\", \"sign up for garbage and recycling pick up day alerts\", \"look up your property taxes\", etc.<\/p><h3>Step 3: Know your risks<\/h3><p>Review the ruling and your accessibility audit and remediation plan with your legal council (city or county attorney for example). Your organization may not be able to meet compliance for all of its web and mobile content before the deadline. Risk and impact will need to be balanced in planning compliance timelines.<\/p><hr><p>Do you have a project or team that needs some expert help? Do you just want to chat about the DOJ Accessibility Ruling and what it might mean to your organization? <a href=\"https:\/\/www.linkedin.com\/in\/joshuami\">Connect with me on LinkedIn<\/a> or reach out to me on Drupal Slack (@joshuami).<\/p>",
            "format": "content_format",
            "processed": "<div class=\"media media--type-image media--view-mode-large\">\n        \t    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-04\/state-and-local-government-accessiblity-response.png.webp?itok=XP7NCXyk 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-04\/state-and-local-government-accessiblity-response.png.webp?itok=k6Ix0efT 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-04\/state-and-local-government-accessiblity-response.png.webp?itok=1ctg60rS 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"288\">\n                  <img src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-04\/state-and-local-government-accessiblity-response.png.webp?itok=XP7NCXyk\" alt=\"A woman wearing headphones using a computer.\" title width=\"500\" height=\"150\" loading=\"lazy\" data-component-id=\"xtra:image\" class=\"img-fluid\">\n  <\/picture>\n\n\n\n              <div class=\"media-edit small m-1\">\n          <a href=\"\/media\/24\/edit\" target=\"_blank\">Edit<\/a>\n        <\/div>\n        <\/div>\n<p>I was a guest on <a href=\"https:\/\/talkingdrupal.com\/498\">Talking Drupal episode #498<\/a> (released Monday, April 21st) to talk about the Department of justice accessibility ruling. While that podcast is focused on Drupal as a content management framework, the topic is not platform specific.<\/p>\n<h2 dir=\"ltr\">What is the U.S. Department of Justice Accessibility Ruling?<\/h2>\n<p dir=\"ltr\">The Web Content Accessibility Guidelines (WCAG) Version 2.1, Level AA is now the technical standard for state and local governments’ web content and mobile apps within the United States.<\/p>\n<p dir=\"ltr\"><a href=\"https:\/\/www.justice.gov\/archives\/opa\/pr\/justice-department-publish-final-rule-strengthen-web-and-mobile-app-access-people\">The rule became effective June 24, 2024<\/a>.<\/p>\n<p dir=\"ltr\"><a href=\"https:\/\/www.ada.gov\/assets\/pdfs\/web-rule.pdf\">Read the full text of the rule (PDF)<\/a>.<\/p>\n<p dir=\"ltr\">Read the fact sheet provided by ADA.gov<\/p>\n<p dir=\"ltr\">Here is a condensed summary of the exceptions:<\/p>\n<ul>\n<li dir=\"ltr\">“Archived” web content that was created before the date of required compliance that is clearly for reference, research, and\/or record keeping in a separate section of the site that has not been updated.<\/li>\n<li dir=\"ltr\">Preexisting conventional electronic documents (Word, PDF, Powerpoint, Spreadsheets, etc.) created before the date of required compliance. (Hard to audit externally, so expect records requests.)<\/li>\n<li dir=\"ltr\">Content posted by a third party where the posting is not due to contractual, licensing, or other arrangements with the public entity. This&nbsp;<strong>does not include<\/strong> applications provided by a third party via a contract with the government including scheduling, calendaring, reservations systems, maps (Google Maps, ArcGIS, etc.), payment systems.<\/li>\n<li dir=\"ltr\">Individualized documents that are password-protected such as a water bill PDF or a file that the person can download associated with their account. (I’m really not sure why this is an exception. The wording seems to allow some pretty critical service-delivery documents, such as a personalized water bill, to be exempt.)<\/li>\n<li dir=\"ltr\">Preexisting social media posts.<\/li>\n<li dir=\"ltr\">Only technical or legal limitations apply to the use of conforming alternate versions. (I don’t think this one will stand up to scrutiny.)<\/li>\n<\/ul>\n<p dir=\"ltr\">It will be up to the state or local government to show that a “minor” infringement of WCAG 2.1 AA is still accessible. In practice, that is going to mean a lot of back and forth in the first few rulings against a state or local government that is out of compliance. The cost of the burden of proof will disproportionately fall on the government entity.<\/p>\n<h2 dir=\"ltr\">Who is impacted? What makes it a government website or mobile application?<\/h2>\n<p dir=\"ltr\">First, there is a little bit of a misunderstanding of part of this ruling. It is not aimed at federal websites. Federal websites have been&nbsp;<em>required<\/em> to be accessible since 1998 with rules and policies over time that have slowly clarified the requirement for WCAG compliance. These standards are known as <a href=\"https:\/\/www.section508.gov\/manage\/laws-and-policies\/\">Section 508<\/a>.<\/p>\n<p dir=\"ltr\">This new rule is specifically aimed at state, local, and special districts with a timeline for compliance based on the size of the organization.<\/p>\n<p dir=\"ltr\">Examples of state and local governments include:<\/p>\n<ul>\n<li dir=\"ltr\">State and local government offices that provide benefits and\/or social services, like food assistance, health insurance, or employment services<\/li>\n<li dir=\"ltr\">Public schools, community colleges, and public universities<\/li>\n<li dir=\"ltr\">State and local police departments<\/li>\n<li dir=\"ltr\">State and local courts<\/li>\n<li dir=\"ltr\">State and local elections offices<\/li>\n<li dir=\"ltr\">Public hospitals and public healthcare clinics<\/li>\n<li dir=\"ltr\">Public parks and recreation programs<\/li>\n<li dir=\"ltr\">Public libraries<\/li>\n<li dir=\"ltr\">Public transit agencies<\/li>\n<\/ul>\n<p dir=\"ltr\">So this definition is interesting. A school district would be required to use the population of its containing city to know when to comply. That is likely going to get challenged by schools that sit in two cities, but I would imagine, the rule will be enforced more strictly rather than having exceptions for smaller districts within large cities at the outset.&nbsp;<\/p>\n<p dir=\"ltr\">For example, my wife’s school district, she’s a school principal, is relatively small in population compared with the much larger Portland Public Schools district nearby. Both are in the same city, so they have the same deadline despite wildly different resources to address the ruling.<\/p>\n<h2 dir=\"ltr\">When does the rule require compliance?<\/h2>\n<p dir=\"ltr\">It’s all about the organization size, but there isn’t a lot of granularity:<\/p>\n<ul>\n<li dir=\"ltr\">State and local governments more than 50,000 people need to be compliant by&nbsp;<strong>April 24, 2026<\/strong>.<\/li>\n<li dir=\"ltr\">State and local governments smaller than 50,000 people need to be compliant by&nbsp;<strong>April 26, 2027<\/strong>.<\/li>\n<li dir=\"ltr\">Special district governments need to be compliant by&nbsp;<strong>April 26, 2027<\/strong>.<\/li>\n<\/ul>\n<p dir=\"ltr\">Per the ruling, there is a definition for a special district.<\/p>\n<blockquote><p dir=\"ltr\">Special district government means a public entity—other than a county, municipality, township, or independent school district—authorized by State law to provide one function or a limited number of designated functions with sufficient administrative and fiscal autonomy to qualify as a separate government and whose population is not calculated by the United States Census Bureau in the most recent decennial Census or Small Area Income and Poverty Estimates.<\/p>\n<\/blockquote>\n<p dir=\"ltr\">An example would be something like Metro in Oregon, which is a special district that includes three counties that are in the Portland metropolitan area. I find it a bit odd that a special district serving more than 50,000 people gets a longer deadline. I wonder a bit if this was to allow more time for organizations that may have less funding (in theory) than a state, county, or city. For instance, Metro has a much smaller communications and IT department than most of the counties it serves.<\/p>\n<h2 dir=\"ltr\">How can websites and mobile applications audit their compliance?<\/h2>\n<p dir=\"ltr\"><a href=\"blank\">Per Drupal.org’s excellent guidance on running an accessibility review<\/a>:<\/p>\n<blockquote><p dir=\"ltr\">Many accessibility problems can be caught by running the page through automated tools. Some of the automated tools include<a href=\"https:\/\/wave.webaim.org\">&nbsp;WAVE<\/a>, <a href=\"https:\/\/tenon.io\/get-code\/\">Tenon<\/a>, <a href=\"https:\/\/accessibilityinsights.io\">Accessibility Insights<\/a>, <a href=\"https:\/\/developers.google.com\/web\/tools\/lighthouse\/\">Google Lighthouse<\/a>, <a href=\"https:\/\/siteimprove.com\/\">Siteimprove<\/a> and the<a href=\"https:\/\/chrome.google.com\/webstore\/search\/siteimprove?hl=en-US\">&nbsp;Siteimprove Accessibility Checker<\/a> extension for Chrome. Some of this can be automated by using<a href=\"https:\/\/github.com\/dequelabs\/axe-core\/\">&nbsp;axe-core<\/a>. These tools will help you quickly catch some accessibility issues, such as the incorrect structure of the markup, missing ARIA attributes and insufficient color contrast.<\/p>\n<\/blockquote>\n<p dir=\"ltr\">Drupal Core has some accessibility checks that require manual testing when the user interface changes. There is&nbsp;<a href=\"https:\/\/www.drupal.org\/project\/drupalci\/issues\/2857808\">automated coverage planned using Nightwatch tests<\/a>—&nbsp;though Playwright is being considered as well.<\/p>\n<p dir=\"ltr\">At a minimum, government organizations need to start running at least rudimentary tests against all their web and mobile applications. (I’m really curious why desktop applications were completely omitted. Likely because they are rare, but I could see lawsuits arising.)<\/p>\n<p dir=\"ltr\">All state and local government organizations should start an accessibility audit strategy now. It will put you in a position to know your risks going into next year's initial deadline.<\/p>\n<h2 dir=\"ltr\">How are most governments faring now?<\/h2>\n<p dir=\"ltr\">Sites running Drupal are already a step ahead of most other platforms in the tests I’ve run. Drupal sites are not perfect, but the community’s commitment to accessibility really shows in these sites—particularly ones running on modern Drupal rather than Drupal 7 or earlier.&nbsp;<\/p>\n<p dir=\"ltr\">The biggest risk to government accessibility of web and mobile content is the copious “custom off the shelf” (COTS) applications from third-party vendors that primarily sell to government organizations.&nbsp;<\/p>\n<p dir=\"ltr\">Some of these systems are great—many reduce the costs of providing services that would be expensive to build internally such as permitting systems, legislative records keeping, and tools to report government fraud and request records all have extremely limited accessibility awareness. However, many of these tools were built before accessibility became a priority. Just take GovQA, it has become a go to for records request systems in government. I’ve seen many implementations of GovQA that are woefully out of date and inaccessible. A recent review of a GovQA instance updated in the past two years has errors such as alt=”img” and layout tables. Layout tables are not only an accessibility issue, but they also represent code debt from at least a decade ago. (CSS layouts for forms and content have been the norm since at least 20 years ago.)<\/p>\n<p dir=\"ltr\">GovQA is not alone in these issues. Granicus (which also owns GovQA) has an agenda and meeting management system that has similar levels of accessibility errors and alerts for a typical installation.<\/p>\n<p dir=\"ltr\">I don't mean to pick on Granicus products. They have some great software trying to improve governement services. Their risk is a bit broader than many vendors because they have acquired so many applications from smaller companies over the past 10 to 15 years. The number of vendors and COTS applications in use by state and local governments is significant. Some even have what is known as a Voluntary Product Accessibility Template or VPAT for short. While some governments have just started to require these documents in procurement processes in the last five years or so, there is absolutely zero enforcement of accuracy for VPATs—after all, they are voluntary.<\/p>\n<h2 dir=\"ltr\">Is one, or even two, years enough time to become compliant?<\/h2>\n<p dir=\"ltr\">No. I disagree strongly with the ruling’s assumption that the changes should be cost neutral for most government organizations. COTS applications alone represent years of development needed by third-party vendors that will have no motivation to improve their products when governments have little recourse or alternative products to deploy.<\/p>\n<p dir=\"ltr\">Developing alternative applications for smaller state and local governments is not feasible. Buying alternatives would both require an alternative to exist and that that alternative is similarly priced. Even if similarly priced alternatives exist, the typical government software procurement process—assuming no new hardware requirements—is at least six months and often a year or more.<\/p>\n<p dir=\"ltr\">Unfortunately, state and local governments within the U.S. should have known these requirements were coming for years. Broad accessibility compliance has simply not been a priority in IT departments that are struggling to keep up with overall demand for digital services.&nbsp;<\/p>\n<p dir=\"ltr\">Even if a state or local government makes accessibility remediation for compliance a priority in their web and mobile applications, it will take years of concentrated effort and better procurement gates to ensure new web and mobile applications are accessible from the start.<\/p>\n<p dir=\"ltr\">I expect the ruling's assumptions will get challenged as state and local governments report on the real costs and timelines for compliance.<\/p>\n<h2 dir=\"ltr\">Why should a government ensure they are compliant with the standards and the ruling?<\/h2>\n<p dir=\"ltr\">Well, because it is the right thing to do. Accessible content and services improve the experience for everyone.<\/p>\n<p dir=\"ltr\">And… I truly believe the ruling could be unevenly enforced based on city demographics. There is a clear correlation between voting preferences and urban density. As a result, progressive cities already doing their best to be as equitable as possible could be targeted with lawsuits and hit with significant financial risks for the 2026 deadline. At a time when many of these organizations are already seeing drastic budget cuts, this possibility should not be taken lightly.<\/p>\n<p dir=\"ltr\">Or maybe I’m wrong. The current executive administration has little interest in promoting diversity, equity, and inclusion initiatives. They have even taken steps to remove language about equity from many federal websites. It's also possible that the ruling is not enforced in any significant way by the Department of Justice.<\/p>\n<p dir=\"ltr\">Even if the DOJ does not enforce the ruling actively, there will likely private lawsuits and significant court rulings to consider.<\/p>\n<p dir=\"ltr\">The time is ticking for the April 24, 2026 and April 26, 2027 deadlines. At the very least, state and local governments should be conducting manual or automated audits of every public facing web or mobile application they use to interact with their communities. Only by knowing the scope of the risk can they begin to address it.<\/p>\n<h2>Next steps<\/h2>\n<h3>Step 1: Plan an audit<\/h3>\n<p>This post points to a few resources that can help you plan an audit. Your audit may include manual and\/or automated tests. The scope of the audit should include all public facing web content (including web applications provided by third-party vendors hosting content on behalf of the government) as well as any mobile applications that can be used by the public.<\/p>\n<p>If your organization does not have a well-defined list of all applications it supports, this is probably the starting point.<\/p>\n<h3>Step 2: Prioritize services<\/h3>\n<p>The biggest impact will be online services that may also serve to reduce costs associated with delivering those services. Think about your tools that are used most often: \"pay my water bill\", \"sign up for garbage and recycling pick up day alerts\", \"look up your property taxes\", etc.<\/p>\n<h3>Step 3: Know your risks<\/h3>\n<p>Review the ruling and your accessibility audit and remediation plan with your legal council (city or county attorney for example). Your organization may not be able to meet compliance for all of its web and mobile content before the deadline. Risk and impact will need to be balanced in planning compliance timelines.<\/p>\n<hr>\n<p>Do you have a project or team that needs some expert help? Do you just want to chat about the DOJ Accessibility Ruling and what it might mean to your organization? <a href=\"https:\/\/www.linkedin.com\/in\/joshuami\">Connect with me on LinkedIn<\/a> or reach out to me on Drupal Slack (@joshuami).<\/p>\n",
            "summary": ""
        }
    ],
    "feeds_item": [],
    "field_description": [
        {
            "value": "The Web Content Accessibility Guidelines (WCAG) Version 2.1, Level AA is now the technical standard for state and local governments’ web content and mobile apps within the United States."
        }
    ],
    "field_featured_image": [],
    "field_seo_description": [],
    "field_seo_image": [],
    "field_seo_title": [],
    "field_tags": [
        {
            "target_type": "taxonomy_term",
            "target_uuid": "6480fb5d-9f08-4a48-80f9-8dc91040f9d8"
        }
    ]
}