{
    "uuid": [
        {
            "value": "031361f1-ba40-47c7-9bc6-8f1e28e1badd"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "blog",
            "target_type": "node_type",
            "target_uuid": "5e1cc3ac-5c8f-4194-a7db-a96757398273"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2025-10-20T16:16:30+00:00"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "94f18ca1-24cf-4db9-8dc7-6771e8d09443"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "711eae9d-1ca7-45a3-a4b1-9f1e585e1f33"
        }
    ],
    "title": [
        {
            "value": "Image Manipulation for Creative Control: Aspect Switcher and Cropping Techniques"
        }
    ],
    "created": [
        {
            "value": "2025-10-14T02:54:00+00:00"
        }
    ],
    "changed": [
        {
            "value": "2025-10-20T16:16:30+00:00"
        }
    ],
    "promote": [
        {
            "value": true
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [
        {
            "value": true
        }
    ],
    "path": [
        {
            "alias": "\/blog\/2025\/image-manipulation-creative-control-aspect-switcher-and-cropping-techniques",
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<p>Update: on October 19, 2025, I presented this blog post at the <a href=\"https:\/\/pnwdrupalsummit.org\/\">Pacific Northwest Drupal Summit<\/a>. (Video link below.) As part of that presentation, I changed my featured image for this post. For those that attended last year's PNWDS, you may remember that my daughter (Mishya) and I gave a presentation called <a href=\"https:\/\/www.youtube.com\/watch?v=u52VA-decdA&amp;list=PLCqt1kv-RbnST8wAis0dcinZNxWJaED03&amp;index=25\">Raising a Digital Native<\/a>. It was great fun. When giving the presentation this year, I found myself without a portrait photo. (I thought I had one, but the ratio must have been off.) Firing up my photo library, the first photos I came across included Mishya at age two playing in the field at the Oregon Zoo. So appropriate for the moment!<\/p><p><a class=\"btn btn-primary\" href=\"\/presentations\/image-manipulation\">View the presentation slides<\/a>&nbsp;<\/p><p><a class=\"btn btn-primary\" href=\"https:\/\/www.youtube.com\/watch?v=OQ7-F54QbFI\">Watch the Presentation on YouTube<\/a><\/p><hr><drupal-media data-entity-type=\"media\" data-entity-uuid=\"c78d03e1-e921-4c65-b4d6-640650ee84a9\" data-align=\"center\" data-caption=\"If you&apos;ve used Drupal image styles, this image should be familiar as it is used for showing the effect of the image style.\">&nbsp;<\/drupal-media><p>Drupal's image manipulation options with image styles, responsive image styles, and image toolkits (GD and Imagemagick) are hard to beat. Have you ever wanted a different image style for landscape versus portrait featured images? Want a custom background fill? Need to make all your images grayscale? Drupal can do that and more. Learn what's possible with image effects to create consistent and performant images.<\/p><h2>Choosing performant image formats<\/h2><p>For many years, the internet was text without images in the form of message boards. It was the World Wide Web, which launched in 1993, that represented the dawn of embedded images.<\/p><p>At the start, GIF and bitmaps were the go to format for images, with JPEG being introduced shortly thereafter.<\/p><p>For many years, the general consensus based on format and browser support suggested that GIF should be used for flat images (and eventually images involving transparency and animation) with few colors and stark lines such as logos and graphics while JPEG could be used for complex rasterized images with many colors and shading. PNG, once widely adopted, took over much of the logo and graphic space with better compression and transparency support.<\/p><p>All of that shifted pretty radically in the past 10 years were WebP support and better browser upgrade paths pushed that format into a premier position for both graphics and complex photography. It just performed better than all the rest and supported both transparency and animation.<\/p><p>In the last few years, AVIF support has increased with up to 30-50% smaller images than WebP at similar quality.<\/p><p>If your site is not using WebP with an AVIF fallback at this point, it is wasting a ton of bandwidth and energy.<\/p><h2>Which image toolkit should I use?<\/h2><p>For years, the responsibility of image performance would fall to designers that would export images for an acceptable size and compression for their use case. This was great for design direction, but it left the less capable editor out of the mix.<\/p><p>Drupal has excelled at provided options for the common editor to upload a high-quality, low compression image (often straight from the camera) to a website and subsequently resizing that image with an image toolkit. The two most common image toolkits for Drupal are GD and Imagemagick (actual spelling). The toolkits can be combined with image styles to resize images on upload as a PHP process.<\/p><p>GD is included in Drupal core. It's good for most use cases. If on a site with at least PHP 8.1, it can support both WebP and AVIF formats.<\/p><p>Imagemagick has long been a go to when you need to support a wider range of image formats. It has quite a few more options for color profiles and advanced effects as well. The <a href=\"https:\/\/www.drupal.org\/project\/imagemagick\">Imagemagick module<\/a> allows Drupal to be aware of all of these capabilities when it is installed on your server. Check with your host to see if Imagemagick is available. Common hosts like Acquia, Amazee, Pantheon, and Upsun have it preinstalled or easily added as an option.<\/p><p>In Drupal, you set the toolkit in the admin menu at media &gt; image toolkit.&nbsp;<\/p><h2>What are image styles?<\/h2><p>Drupal's concept of image styles allows you to create style and apply a series of effects. For example, you can convert an image to a new format, crop, resize, and scale. The order of the effects is essential to getting the desired result.<\/p><p>A typical image style, might do the following:<\/p><ul><li>Focal Point Scale and Crop 330×165 (This is a single effect that sets the overall image size.)<\/li><li>Convert WebP (I usually do conversions after any scaling or cropping.)<\/li><\/ul><p>Advanced effects might include adding text to an image or converting it to a circle with a transparent background.<\/p><drupal-media data-entity-type=\"media\" data-entity-uuid=\"db968aea-b573-4c70-b0b6-b07e2ad9066d\" data-view-mode=\"large\">&nbsp;<\/drupal-media><h2>What are responsive image styles?<\/h2><p>Drupal's concept of responsive images allows you to provide design direction based on multiple breakpoints defined in your theme.<\/p><p>Breakpoints are measurements of common viewport sizes converted that browsers interpret to choose which image is loaded from a list of possible images.<\/p><p>For every responsive image, you define the rules for when the breakpoint will deliver a different image style.&nbsp;<\/p><p>The result is that your site will deliver the image that is at the size appropriate to the device loading the webpage. This may be a little more complicated that you might first think. The ideal size is going to be a combination of the devices rendered viewport size (pixel width), but it also takes into account pixel density. So an older computer with a 1024 pixel width viewport might need a smaller overall image than a mobile device with 3 times or 4 times pixel density.&nbsp;<\/p><h2>When should I use <code>picture<\/code> versus <code>srcset<\/code>?<\/h2><p>It's because of pixel density selection that I usually recommend sites use the <code>img<\/code> element with the <code>srcset<\/code> and <code>sizes<\/code> attributes rather than the <code>picture<\/code> element. These attributes allow you to suggest your intent and let the browser choose the best image. The <code>picture<\/code> element explicitly sets the image size based on the viewport width.&nbsp;<\/p><p>The one time the <code>picture<\/code> approach is extremely helpful is when you deliver a different aspect ration when the viewport is a particular size. An example would be a site that loads a 16:9 ratio image (widescreen, landscape) for larger displays and a 1:1 ratio image (square) for smaller displays. &nbsp;I would caution against this for editor or user uploaded images. They simply won't have the skill an ability to crop the image correctly most of the time.<\/p><h2>Options to crop images in Drupal<\/h2><p>So if you have editors or users uploading images, how do you get the sized and cropped in a way that meets your design intentions.&nbsp;<\/p><p>For images uploaded and embedded within content, such as with the media library embed in CKEditor, you probably don't want to provide a default cropping option. Whatever the editor has uploaded is likely the height and width they intend—or at least it will work for the situation.<\/p><p>For images uploaded in an area strictly intended for a specific aspect ratio, such as 16:9 or 2:1 or 1:1, the 3:4 or 4:3 photo taken with a mobile phone (or any camera) may not be the size you'd like. The solution is cropping the image to match the aspect ratio as part of the upload process.<\/p><p>Image styles in Drupal core support both scale and crop as well as crop and scale—but you probably don't want either of these options.&nbsp;<\/p><p>Scale and crop may work if you are lucky enough that the image's subject is positioned within the exact center of the photograph. I find this rare in practice. If you are a trained photographer, you learn to frame your subject based on the window you are viewing. If your aspect ratio is 4:3 (landscape), then you fill that window, likewise if your window is 3:4 (portrait). That doesn't work well if your image style does a scale and crop to 16:9.<\/p><p>Crop and scale rarely works. It assumes you can crop an image to a size before you scale it. If you have a portrait of a face, you might et just a nose or mouth... and nothing else.<\/p><p>There are two contrib modules to help editors convey their intention for what they crop should be.<\/p><p>If you install the <a href=\"https:\/\/www.drupal.org\/project\/crop\">Crop API<\/a>, there are a couple of modules that can help with this.<\/p><p>I'll start with the one that doesn't usually work the way I want it to work...<\/p><p><a href=\"https:\/\/www.drupal.org\/project\/image_widget_crop\">Image Widget Crop<\/a> lets folks crop images to the dimensions they want to see in the final crop. It does not enforce a specific ratio. So if you let an editor add some crop lines around the subject, you then have to use the scale in crop in core to capture that intention. It results in some weird edge cases that I just don't like.<\/p><p><a href=\"https:\/\/www.drupal.org\/project\/focal_point\">Focal Point<\/a> allows for cropping based on a designated \"center point\" of the image. You drag some crosshairs over the point you want to make sure you don't lose and let the aspect ratio determine the rest. This works amazingly well for any landscape image that is being cropped to a more narrowly defined landscape image. Combined with a preview, you can help editors understand what they will get from the focal point they chose.<\/p><drupal-media data-entity-type=\"media\" data-entity-uuid=\"dc27905a-1479-449e-b257-b22ab5c28b2e\" data-view-mode=\"large\">&nbsp;<\/drupal-media><p>It works great... up to the point that someone uploads a portrait image, sometimes called a mug shot.&nbsp;<\/p><p>When the image is portrait, you may not want to crop. In fact, you may need to convert the image and put it onto a canvas to set an image that looks like it is floating on your landscape aspect image.<\/p><p>This is possible by scaling your image first to give it an expected height, then converting the image to allow it to be set on a canvas (centered or shifted left or right) with a transparent background. The transparent background allows you to set the background for the image using CSS in your theme's styles.<\/p><drupal-media data-entity-type=\"media\" data-entity-uuid=\"d927daaa-f4d5-4ed2-b08f-26fd61262670\" data-view-mode=\"large\">&nbsp;<\/drupal-media><p>However, to have this image style work with only portrait images, you need a little help from the image effects module.<\/p><h2>Providing design direction with aspect switching<\/h2><p>Cropping a portrait image, say a person looking at the camera from the waist up with a vertical orientation, is a challenge when that image will be used in a fixed ratio featured region. Even if you perfectly tag the focal point of a face in a 3:4 ratio portrait image, then you might end up cutting off the top of a head or the bottom of a chin.&nbsp;<\/p><p>So if you want to allow your editors to upload a portrait image when creating a landscape featured image, what do you do?<\/p><p>Enter Image Effects and the aspect switcher effect. The module adds a ton of effects for image styles, but the aspect switcher, in particular, lets you define the ratio at which you want to use a different cropping technique. Take that... every other platform I've ever used for content management.<\/p><drupal-media data-entity-type=\"media\" data-entity-uuid=\"05715989-ec06-4527-bba9-c4952fdee2e1\" data-view-mode=\"large\" data-caption=\"Think of an aspect switcher image style as a style that incorporates rules for using to other styles that will actually be used for the output. Pay special attention to the resize effect that resets the image width and height. Without that effect, responsive image styles cannot use an aspect-switcher-based style.\">&nbsp;<\/drupal-media><drupal-media data-entity-type=\"media\" data-entity-uuid=\"7987e85f-7a07-4b19-8431-9b7b7b319f93\" data-view-mode=\"large\" data-caption=\"Compare the names of the two image styles used by the responsive image style.\">&nbsp;<\/drupal-media><p>Aspect switching allows you to choose two image styles to use depending on the defined aspect ratio. So if you want to use Focal Point with any landscape image (greater than 1:1) and place the image within a set 16:9 canvas for any image that is square or more portrait (less than or equal to 1:1) then you can.&nbsp;<\/p><p>Add a background color, or better yet a transparency so you can set the background color depending on the use, and you are set.&nbsp;<\/p><drupal-media data-entity-type=\"media\" data-entity-uuid=\"959df181-5391-48c5-b972-0a58126d6138\" data-view-mode=\"large\" data-caption=\"Now you need to use all your aspect switching styles in the responsive image style.\">&nbsp;<\/drupal-media><p>Aspect switching was a game changer on a recent project. It allowed for much more specific design direction in our theme.&nbsp;<\/p><hr><p>Finding that you need a little help in your quest to help editors upload images that meet your design needs? <a href=\"https:\/\/www.linkedin.com\/in\/joshuami\">Connect with me on LinkedIn<\/a> or reach out to me on Drupal Slack (@joshuami).<\/p>",
            "format": "content_format",
            "processed": "<p>Update: on October 19, 2025, I presented this blog post at the <a href=\"https:\/\/pnwdrupalsummit.org\/\">Pacific Northwest Drupal Summit<\/a>. (Video link below.) As part of that presentation, I changed my featured image for this post. For those that attended last year's PNWDS, you may remember that my daughter (Mishya) and I gave a presentation called <a href=\"https:\/\/www.youtube.com\/watch?v=u52VA-decdA&amp;list=PLCqt1kv-RbnST8wAis0dcinZNxWJaED03&amp;index=25\">Raising a Digital Native<\/a>. It was great fun. When giving the presentation this year, I found myself without a portrait photo. (I thought I had one, but the ratio must have been off.) Firing up my photo library, the first photos I came across included Mishya at age two playing in the field at the Oregon Zoo. So appropriate for the moment!<\/p>\n<p><a class=\"btn btn-primary\" href=\"\/presentations\/image-manipulation\">View the presentation slides<\/a>&nbsp;<\/p>\n<p><a class=\"btn btn-primary\" href=\"https:\/\/www.youtube.com\/watch?v=OQ7-F54QbFI\">Watch the Presentation on YouTube<\/a><\/p>\n<hr>\n<figure role=\"group\" class=\"caption caption-drupal-media align-center\">\n<article class=\"media media--type-image media--view-mode-medium\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/sample.png.webp?itok=wKB15w5P 500w, \/sites\/default\/files\/styles\/uncropped_600w_webp\/public\/2025-10\/sample.png.webp?itok=KnchZQN_ 600w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"600\" height=\"360\">\n                  <img loading=\"lazy\" width=\"500\" height=\"300\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/sample.png.webp?itok=wKB15w5P\" alt=\"Balloons over a vinyard. It's a default image for Drupal image styles.\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n\n<figcaption>If you've used Drupal image styles, this image should be familiar as it is used for showing the effect of the image style.<\/figcaption>\n<\/figure>\n<p>Drupal's image manipulation options with image styles, responsive image styles, and image toolkits (GD and Imagemagick) are hard to beat. Have you ever wanted a different image style for landscape versus portrait featured images? Want a custom background fill? Need to make all your images grayscale? Drupal can do that and more. Learn what's possible with image effects to create consistent and performant images.<\/p>\n<h2>Choosing performant image formats<\/h2>\n<p>For many years, the internet was text without images in the form of message boards. It was the World Wide Web, which launched in 1993, that represented the dawn of embedded images.<\/p>\n<p>At the start, GIF and bitmaps were the go to format for images, with JPEG being introduced shortly thereafter.<\/p>\n<p>For many years, the general consensus based on format and browser support suggested that GIF should be used for flat images (and eventually images involving transparency and animation) with few colors and stark lines such as logos and graphics while JPEG could be used for complex rasterized images with many colors and shading. PNG, once widely adopted, took over much of the logo and graphic space with better compression and transparency support.<\/p>\n<p>All of that shifted pretty radically in the past 10 years were WebP support and better browser upgrade paths pushed that format into a premier position for both graphics and complex photography. It just performed better than all the rest and supported both transparency and animation.<\/p>\n<p>In the last few years, AVIF support has increased with up to 30-50% smaller images than WebP at similar quality.<\/p>\n<p>If your site is not using WebP with an AVIF fallback at this point, it is wasting a ton of bandwidth and energy.<\/p>\n<h2>Which image toolkit should I use?<\/h2>\n<p>For years, the responsibility of image performance would fall to designers that would export images for an acceptable size and compression for their use case. This was great for design direction, but it left the less capable editor out of the mix.<\/p>\n<p>Drupal has excelled at provided options for the common editor to upload a high-quality, low compression image (often straight from the camera) to a website and subsequently resizing that image with an image toolkit. The two most common image toolkits for Drupal are GD and Imagemagick (actual spelling). The toolkits can be combined with image styles to resize images on upload as a PHP process.<\/p>\n<p>GD is included in Drupal core. It's good for most use cases. If on a site with at least PHP 8.1, it can support both WebP and AVIF formats.<\/p>\n<p>Imagemagick has long been a go to when you need to support a wider range of image formats. It has quite a few more options for color profiles and advanced effects as well. The <a href=\"https:\/\/www.drupal.org\/project\/imagemagick\">Imagemagick module<\/a> allows Drupal to be aware of all of these capabilities when it is installed on your server. Check with your host to see if Imagemagick is available. Common hosts like Acquia, Amazee, Pantheon, and Upsun have it preinstalled or easily added as an option.<\/p>\n<p>In Drupal, you set the toolkit in the admin menu at media &gt; image toolkit.&nbsp;<\/p>\n<h2>What are image styles?<\/h2>\n<p>Drupal's concept of image styles allows you to create style and apply a series of effects. For example, you can convert an image to a new format, crop, resize, and scale. The order of the effects is essential to getting the desired result.<\/p>\n<p>A typical image style, might do the following:<\/p>\n<ul>\n<li>Focal Point Scale and Crop 330×165 (This is a single effect that sets the overall image size.)<\/li>\n<li>Convert WebP (I usually do conversions after any scaling or cropping.)<\/li>\n<\/ul>\n<p>Advanced effects might include adding text to an image or converting it to a circle with a transparent background.<\/p>\n<article class=\"media media--type-image media--view-mode-large\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/image-styles-configuration.png.webp?itok=R3PFTEpv 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-10\/image-styles-configuration.png.webp?itok=lUXhspp1 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-10\/image-styles-configuration.png.webp?itok=y7uxHVOJ 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"567\">\n                  <img loading=\"lazy\" width=\"500\" height=\"295\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/image-styles-configuration.png.webp?itok=R3PFTEpv\" alt=\"Configuration for image styles showing a list of strongly typed style names.\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n<h2>What are responsive image styles?<\/h2>\n<p>Drupal's concept of responsive images allows you to provide design direction based on multiple breakpoints defined in your theme.<\/p>\n<p>Breakpoints are measurements of common viewport sizes converted that browsers interpret to choose which image is loaded from a list of possible images.<\/p>\n<p>For every responsive image, you define the rules for when the breakpoint will deliver a different image style.&nbsp;<\/p>\n<p>The result is that your site will deliver the image that is at the size appropriate to the device loading the webpage. This may be a little more complicated that you might first think. The ideal size is going to be a combination of the devices rendered viewport size (pixel width), but it also takes into account pixel density. So an older computer with a 1024 pixel width viewport might need a smaller overall image than a mobile device with 3 times or 4 times pixel density.&nbsp;<\/p>\n<h2>When should I use <code>picture<\/code> versus <code>srcset<\/code>?<\/h2>\n<p>It's because of pixel density selection that I usually recommend sites use the <code>img<\/code> element with the <code>srcset<\/code> and <code>sizes<\/code> attributes rather than the <code>picture<\/code> element. These attributes allow you to suggest your intent and let the browser choose the best image. The <code>picture<\/code> element explicitly sets the image size based on the viewport width.&nbsp;<\/p>\n<p>The one time the <code>picture<\/code> approach is extremely helpful is when you deliver a different aspect ration when the viewport is a particular size. An example would be a site that loads a 16:9 ratio image (widescreen, landscape) for larger displays and a 1:1 ratio image (square) for smaller displays. &nbsp;I would caution against this for editor or user uploaded images. They simply won't have the skill an ability to crop the image correctly most of the time.<\/p>\n<h2>Options to crop images in Drupal<\/h2>\n<p>So if you have editors or users uploading images, how do you get the sized and cropped in a way that meets your design intentions.&nbsp;<\/p>\n<p>For images uploaded and embedded within content, such as with the media library embed in CKEditor, you probably don't want to provide a default cropping option. Whatever the editor has uploaded is likely the height and width they intend—or at least it will work for the situation.<\/p>\n<p>For images uploaded in an area strictly intended for a specific aspect ratio, such as 16:9 or 2:1 or 1:1, the 3:4 or 4:3 photo taken with a mobile phone (or any camera) may not be the size you'd like. The solution is cropping the image to match the aspect ratio as part of the upload process.<\/p>\n<p>Image styles in Drupal core support both scale and crop as well as crop and scale—but you probably don't want either of these options.&nbsp;<\/p>\n<p>Scale and crop may work if you are lucky enough that the image's subject is positioned within the exact center of the photograph. I find this rare in practice. If you are a trained photographer, you learn to frame your subject based on the window you are viewing. If your aspect ratio is 4:3 (landscape), then you fill that window, likewise if your window is 3:4 (portrait). That doesn't work well if your image style does a scale and crop to 16:9.<\/p>\n<p>Crop and scale rarely works. It assumes you can crop an image to a size before you scale it. If you have a portrait of a face, you might et just a nose or mouth... and nothing else.<\/p>\n<p>There are two contrib modules to help editors convey their intention for what they crop should be.<\/p>\n<p>If you install the <a href=\"https:\/\/www.drupal.org\/project\/crop\">Crop API<\/a>, there are a couple of modules that can help with this.<\/p>\n<p>I'll start with the one that doesn't usually work the way I want it to work...<\/p>\n<p><a href=\"https:\/\/www.drupal.org\/project\/image_widget_crop\">Image Widget Crop<\/a> lets folks crop images to the dimensions they want to see in the final crop. It does not enforce a specific ratio. So if you let an editor add some crop lines around the subject, you then have to use the scale in crop in core to capture that intention. It results in some weird edge cases that I just don't like.<\/p>\n<p><a href=\"https:\/\/www.drupal.org\/project\/focal_point\">Focal Point<\/a> allows for cropping based on a designated \"center point\" of the image. You drag some crosshairs over the point you want to make sure you don't lose and let the aspect ratio determine the rest. This works amazingly well for any landscape image that is being cropped to a more narrowly defined landscape image. Combined with a preview, you can help editors understand what they will get from the focal point they chose.<\/p>\n<article class=\"media media--type-image media--view-mode-large\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/image-style-focal-point-crop.png.webp?itok=CfUEGSNI 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-10\/image-style-focal-point-crop.png.webp?itok=ixZSNfAC 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-10\/image-style-focal-point-crop.png.webp?itok=KzC1xqAC 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"566\">\n                  <img loading=\"lazy\" width=\"500\" height=\"295\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/image-style-focal-point-crop.png.webp?itok=CfUEGSNI\" alt=\"Editing an image style with focal point crop\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n<p>It works great... up to the point that someone uploads a portrait image, sometimes called a mug shot.&nbsp;<\/p>\n<p>When the image is portrait, you may not want to crop. In fact, you may need to convert the image and put it onto a canvas to set an image that looks like it is floating on your landscape aspect image.<\/p>\n<p>This is possible by scaling your image first to give it an expected height, then converting the image to allow it to be set on a canvas (centered or shifted left or right) with a transparent background. The transparent background allows you to set the background for the image using CSS in your theme's styles.<\/p>\n<article class=\"media media--type-image media--view-mode-large\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/edit-portrait-style-order-of%20operations.png.webp?itok=iP1c5Vmu 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-10\/edit-portrait-style-order-of%20operations.png.webp?itok=A9nETQpO 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-10\/edit-portrait-style-order-of%20operations.png.webp?itok=GZTq6FCu 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"567\">\n                  <img loading=\"lazy\" width=\"500\" height=\"295\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/edit-portrait-style-order-of%20operations.png.webp?itok=iP1c5Vmu\" alt=\"Edit view of a portrait style image that requires the specific order of operations listed above.\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n<p>However, to have this image style work with only portrait images, you need a little help from the image effects module.<\/p>\n<h2>Providing design direction with aspect switching<\/h2>\n<p>Cropping a portrait image, say a person looking at the camera from the waist up with a vertical orientation, is a challenge when that image will be used in a fixed ratio featured region. Even if you perfectly tag the focal point of a face in a 3:4 ratio portrait image, then you might end up cutting off the top of a head or the bottom of a chin.&nbsp;<\/p>\n<p>So if you want to allow your editors to upload a portrait image when creating a landscape featured image, what do you do?<\/p>\n<p>Enter Image Effects and the aspect switcher effect. The module adds a ton of effects for image styles, but the aspect switcher, in particular, lets you define the ratio at which you want to use a different cropping technique. Take that... every other platform I've ever used for content management.<\/p>\n<figure role=\"group\" class=\"caption caption-drupal-media\">\n<article class=\"media media--type-image media--view-mode-large\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/aspect-switcher-image-style.png.webp?itok=j2BKcsAh 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-10\/aspect-switcher-image-style.png.webp?itok=YGeUOmrI 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-10\/aspect-switcher-image-style.png.webp?itok=03XGcLgd 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"567\">\n                  <img loading=\"lazy\" width=\"500\" height=\"295\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/aspect-switcher-image-style.png.webp?itok=j2BKcsAh\" alt=\"An aspect switcher image style with the aspect switcher and resize of the final image.\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n\n<figcaption>Think of an aspect switcher image style as a style that incorporates rules for using to other styles that will actually be used for the output. Pay special attention to the resize effect that resets the image width and height. Without that effect, responsive image styles cannot use an aspect-switcher-based style.<\/figcaption>\n<\/figure>\n<figure role=\"group\" class=\"caption caption-drupal-media\">\n<article class=\"media media--type-image media--view-mode-large\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/edit-aspect-switcher-style.png.webp?itok=7AKcsV6y 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-10\/edit-aspect-switcher-style.png.webp?itok=-pDqEcWN 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-10\/edit-aspect-switcher-style.png.webp?itok=EG1Poodq 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"567\">\n                  <img loading=\"lazy\" width=\"500\" height=\"295\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/edit-aspect-switcher-style.png.webp?itok=7AKcsV6y\" alt=\"Editing the aspect switcher style to choose portraint when the ratio is greater than one.\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n\n<figcaption>Compare the names of the two image styles used by the responsive image style.<\/figcaption>\n<\/figure>\n<p>Aspect switching allows you to choose two image styles to use depending on the defined aspect ratio. So if you want to use Focal Point with any landscape image (greater than 1:1) and place the image within a set 16:9 canvas for any image that is square or more portrait (less than or equal to 1:1) then you can.&nbsp;<\/p>\n<p>Add a background color, or better yet a transparency so you can set the background color depending on the use, and you are set.&nbsp;<\/p>\n<figure role=\"group\" class=\"caption caption-drupal-media\">\n<article class=\"media media--type-image media--view-mode-large\">\n  \n      \n  <div class=\"field field--name-field-media-image field--type-image field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Image<\/div>\n              <div class=\"field__item\">    <picture>\n                  <source srcset=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/responsive-image-style-with-aspect-switcher.png.webp?itok=oh9qW0xT 500w, \/sites\/default\/files\/styles\/uncropped_700w_webp\/public\/2025-10\/responsive-image-style-with-aspect-switcher.png.webp?itok=Rvj05AoB 700w, \/sites\/default\/files\/styles\/uncropped_960w_webp\/public\/2025-10\/responsive-image-style-with-aspect-switcher.png.webp?itok=OHovCsRx 960w\" media=\"all and (min-width: 500px)\" type=\"image\/webp\" sizes=\"100vw\" width=\"960\" height=\"568\">\n                  <img loading=\"lazy\" width=\"500\" height=\"296\" src=\"\/sites\/default\/files\/styles\/uncropped_500w_webp\/public\/2025-10\/responsive-image-style-with-aspect-switcher.png.webp?itok=oh9qW0xT\" alt=\"Responsive image style definition to use srcset alternates based on viewport width.\">\n\n  <\/picture>\n\n<\/div>\n          <\/div>\n\n  <\/article>\n\n<figcaption>Now you need to use all your aspect switching styles in the responsive image style.<\/figcaption>\n<\/figure>\n<p>Aspect switching was a game changer on a recent project. It allowed for much more specific design direction in our theme.&nbsp;<\/p>\n<hr>\n<p>Finding that you need a little help in your quest to help editors upload images that meet your design needs? <a href=\"https:\/\/www.linkedin.com\/in\/joshuami\">Connect with me on LinkedIn<\/a> or reach out to me on Drupal Slack (@joshuami).<\/p>\n",
            "summary": ""
        }
    ],
    "feeds_item": [],
    "field_description": [
        {
            "value": "Drupal's image manipulation options with image styles, responsive image styles, and image toolkits (GD and Imagemagick) are hard to beat. Have you ever wanted a different image style for landscape versus portrait featured images? Want a custom background fill? Need to make all your images grayscale? Drupal can do that and more. Learn what's possible with image effects to create consistent and performant images."
        }
    ],
    "field_featured_image": [
        {
            "target_type": "media",
            "target_uuid": "11b7ad88-4c47-497b-9152-9b1f2192e20d"
        }
    ],
    "field_seo_description": [],
    "field_seo_image": [],
    "field_seo_title": [],
    "field_tags": [
        {
            "target_type": "taxonomy_term",
            "target_uuid": "953d2094-d408-40ba-ace8-62e8da23eb27"
        },
        {
            "target_type": "taxonomy_term",
            "target_uuid": "f9cd97d8-92b2-4f54-ba5d-4a46b88467cd"
        },
        {
            "target_type": "taxonomy_term",
            "target_uuid": "49f21fb2-ddbc-4f40-a0cd-0d9a0d084d36"
        }
    ]
}